<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Практика</title>
<link rel="stylesheet" href="css/stylemenu.css"/>
<link rel="stylesheet" href="css/style.css"/>
<link rel="stylesheet" href="css/stylefon.css"/>
</head>
<body id="body">
<div id="fon1">


    <input type="checkbox" id="nav-toggle" hidden>
    <nav class="nav">

        <label for="nav-toggle" class="nav-toggle" onclick></label>
        <h2 class="logo"> 
            <a href="index.php">Практика</a> 
        </h2>
        <ul>
            <li><a href="index.php">Главная</a>
			<hr>
            <li><a href="image/pas.pdf" target="_blank">Паспорт персонального компьютера</a>
			<hr>
			<li><a href="index3.php">Замена USB разъемов в ноутбуке </a>
			<hr>
            <li><a href="index4.php">Топология сети</a>
			<hr>
            <li><a href="index5.php">Структурная схема</a>
			<hr>
			<li><a href="index6.php">Интервью</a>
			<hr>
			<li><a href="image/shablon.dotx" target="_blank">Шаблон делового письма</a>
			<hr>
        </ul>
    </nav>
<h2><a href="index4.php" id="logo">Топологии сети </a></h2>
<hr>
<figure class="fig">
<img src='image/shema.png'/>
<hr>
<h3>
Локальные сети предназначены для обмена информацией между компьютерами, расположенными на небольшом расстоянии друг от друга, в пределах одного здания.
Локальная сеть — это объединение компьютеров, расположенных на небольшом расстоянии друг от друга.
Локальные сети позволяют:</p>
<p>•	совместно использовать аппаратные ресурсы (периферийные устройства, накопители);</p>
<p>•	совместно использовать программные ресурсы (сетевые версии прикладного программного обеспечения);</p>
<p>•	создавать и совместно использовать информационные ресурсы для работы пользователей над общими задачами;</p>
<p>•	централизовать усилия по информационной безопасности.</p>
По способу связи компьютеров в локальной сети различают:</p>
<p>•	одноранговые сети;</p>
<p>•	сети с выделенным сервером.</p>
<p>В одноранговых сетях используется технология «равный к равному».
Любой компьютер может использовать ресурсы другого подключенного к нему компьютера.
Иначе говоря, любой компьютер может выступать и как сервер, и как клиент.
В одноранговых сетях работа приложений на компьютере ухудшается, когда его ресурсами пользуются другие компьютеры сети. Сети с выделенным сервером в этом смысле гораздо стабильнее и производительнее.
В современных локальных сетях компьютеры и периферийное оборудование объединяются проводными, волоконно-оптическими, а также беспроводными каналами передачи данных.
Сопряжение компьютеров с каналами связи обеспечивает специальное коммуникационное оборудование.
<p>Корпоративные сети</p>
Для больших организаций (корпораций) характерно наличие филиалов, подразделений, отдалённых друг от друга на значительные расстояния. Как правило, в каждом филиале имеется своя локальная сеть.
Объединение разрозненных локальных сетей в пределах одной корпорации в единую образует корпоративную сеть.
Корпоративная сеть — это объединение локальных сетей в пределах одной корпорации для решения общих задач.
Для корпоративных сетей характерно сочетание централизованной обработки информации с использованием удалённого соединения компьютеров.
Информация может изменяться работниками, имеющими к ней доступ.
Описанные выше сети могут иметь выход в другие внешние сети, например для того, чтобы получить информацию из удалённых баз данных, переслать сообщение по электронной почте в другую сеть или отправить факс.
В настоящее время для связи компьютеров в корпоративных сетях разработана новая технология — технология Интранет.
Интранет использует опыт работы в распределённой среде (протоколы и технологию Интернет) и построена на технологии «клиент-сервер» с централизованной обработкой информации. Это позволяет организовать распределённую корпоративную информационную систему и достичь наибольшей эффективности работы.
Среди телекоммуникационных сетей, получивших распространение за последние годы, особое место занимают малые компьютерные сети, или BBS имеющие всего один хост-компьютер.
BBS представляет собой общедоступную библиотеку разнообразных файлов. BBS являются главным распространителем демоверсий программного обеспечения, игр, компьютерных новостей.
Главное достоинство BBS состоит том, что хозяину (системному оператору) достаточно иметь компьютер с модемом и жёстким диском большой ёмкости, а пользователю для связи с ним не нужно никакой сети, достаточно иметь модем и телефон.
Большинство BBS — детище любителей, но существуют станции, распространяющие коммерческую информацию, рекламу, программные продукты. Многие солидные компьютерные сети предоставляют через BBS разнообразные сервисные и информационные услуги.
</h3>
</div>
</body>