<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Практика</title>
<link rel="stylesheet" href="css/stylemenu.css"/>
<link rel="stylesheet" href="css/style.css"/>
<link rel="stylesheet" href="css/stylefon.css"/>
</head>
<body id="body">
<div id="fon1">


    <input type="checkbox" id="nav-toggle" hidden>
    <nav class="nav">

        <label for="nav-toggle" class="nav-toggle" onclick></label>
        <h2 class="logo"> 
            <a href="index.php">Практика</a> 
        </h2>
        <ul>
            <li><a href="index.php">Главная</a>
			<hr>
            <li><a href="image/pas.pdf" target="_blank">Паспорт персонального компьютера</a>
			<hr>
			<li><a href="index3.php">Замена USB разъемов в ноутбуке </a>
			<hr>
            <li><a href="index4.php">Топология сети</a>
			<hr>
            <li><a href="index5.php">Структурная схема</a>
			<hr>
			<li><a href="index6.php">Интервью</a>
			<hr>
			<li><a href="image/shablon.dotx" target="_blank">Шаблон делового письма</a>
			<hr>
        </ul>
    </nav>
<h2><a href="index5.php" id="logo">Замена USB разъемов в ноутбуке</a></h2>
<hr>
<figure class="fig">
<h3>USB - универсальный, удобный и поэтому популярный интерфейс. С его помощью к ноутбуку можно подключить внешние накопители, мышь, клавиатуру, принтер, джойстик, многие другие устройства, осуществить передачу данных между ноутбуком и смартфоном.</h3>
<p><img src='image/112.png'/></p>
<h3>Ввиду частого использования USB разъемы подвержены механическим повреждениям, что доставляет значительные неудобства, так как не во всех моделях ноутбуков имеется достаточное количество USB портов. Иногда производитель оснащает ноутбук только двумя USB портами, и при выходе из строя одного из них оставшегося не хватает для комфортной работы. Также достаточно часто пользователю нужен порт USB 2.0, а такой присутствует только один и, в случае его неисправности загрузить ноутбук с флэш–накопителя невозможно, так как оставшиеся порты USB 3.0 не работают без драйвера.
Ремонт USB разъема рекомендуется производить независимо от того, планируете ли вы им пользоваться. Дело в том, что в поврежденном разъеме высока вероятность замыкания контактов между собой, что может привести к выходу из строя контроллера USB, а это влечет за собой дорогостоящий ремонт, так как в современных ноутбуках USB-контроллер находится либо в чипе южного моста или хаба, либо непосредственно в процессоре, который в придачу запаян.
Иногда внешне разъем выглядит целым, но не работает. В этом случае вероятно, что USB контроллер все-таки вышел из строя, например, из-за статического напряжения во время подключения к включенному принтеру.
Замена разъема USB в ноутбуке производится путем выпаивания на паяльной станции старого разъема из материнской платы и запаивания нового. </h3>
<p><img src='image/21312.png'/></p>
<h3>Старайтесь аккуратно пользоваться USB разъемами ноутбука, чтобы избежать необходимости ремонта. В случае же повреждения разъема рекомендуем не откладывать его замену.</h3>

<hr>
</div>
</body>